tap "git-friendly/git-friendly"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
tap "keith/formulae"
tap "facebook/fb"


# Fonts
cask "font-sf-mono-for-powerline"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-mono"
cask "font-fira-sans-condensed"
cask "font-fira-sans"

# Utilities
brew "apr-util"                 # Libraries for Apache Portable Runtime
brew "aspell"                   # Spell checker for text processing
brew "fzf"                      # Command-line fuzzy finder
brew "lf"                       # Terminal file manager
brew "automake"                 # Tool for generating Makefile.in
brew "awscli"                   # Amazon AWS CLI
brew "bash"                     # Bourne Again Shell
brew "bazel"                    # Build tool for large-scale software
brew "bazelisk"                 # User-friendly Bazel launcher
brew "boost"                    # C++ libraries
brew "glib"                     # Core application library for GNOME
brew "pkg-config"               # Manage compile and link flags
brew "cairo"                    # Vector graphics library
brew "cmake"                    # Build system and project generator
brew "cocoapods"                # Dependency manager for Swift/Obj-C projects
brew "coreutils"                # GNU core utilities (better `ls`, `cp`, etc.)
brew "diff-so-fancy"            # Improve git diff output
brew "direnv"                   # Manage environment variables per project
brew "guile"                    # GNU's extension language platform
brew "unbound"                  # Validating, recursive DNS resolver
brew "gnutls"                   # Secure communication library
brew "fd"                       # Fast and user-friendly alternative to `find`
brew "harfbuzz"                 # OpenType text shaping engine
brew "libass"                   # Subtitle rendering library
brew "srt"                      # Secure, reliable transport protocol library
brew "ffmpeg"                   # Video/audio streaming library
brew "findutils"                # GNU utilities to search files
brew "git"                      # Distributed version control system
brew "git-lfs"                  # Git extension for large files
brew "go"                       # Open-source programming language
brew "grep"                     # Pattern searching tool
brew "grpc"                     # RPC framework
brew "htop"                     # Interactive process viewer
brew "httpie"                   # User-friendly HTTP client
brew "hub"                      # GitHub CLI for Git
brew "jq"                       # Command-line JSON processor
brew "lazygit"                  # Simple terminal UI for Git
brew "libvterm"                 # Terminal emulation library
brew "luv"                      # Lightweight Lua binding for libuv
brew "mackup"                   # Backup and restore app settings
brew "mas"                      # macOS App Store CLI
brew "maven"                    # Build automation tool for Java projects
brew "neovim"                   # Modern Vim-based text editor
brew "nghttp2"                  # HTTP/2 C library
brew "node"                     # JavaScript runtime
brew "nvm"                      # Node.js version manager
brew "poppler"                  # PDF rendering library
brew "qt"                       # Application development framework
brew "ruby-build"               # Install Ruby versions
brew "rbenv"                    # Manage Ruby environments
brew "ripgrep"                  # Fast search in files (better `grep`)
brew "ruby"                     # Ruby programming language
brew "shellcheck"               # Shell script analysis tool
brew "subversion"               # Version control system
brew "the_silver_searcher"      # Code searching tool (better `grep`)
brew "tmux"                     # Terminal multiplexer
brew "trash"                    # Trash CLI (better `rm`)
brew "tree"                     # Directory listing in a tree structure
brew "wget"                     # Download files from the web
brew "yarn"                     # JavaScript package manager
brew "youtube-dl"               # Video downloader from YouTube and others
brew "midnight-commander"       # Terminal file manager
brew "inav"                     # Configurator for flight controllers (Rosetta thingy)
brew "less"                     # File pager utility

# CLI Tools
brew "bat"                      # Enhanced file viewer (better `cat`)
brew "fastfetch"                # System information tool
brew "fnm"                      # Fast Node.js version manager
brew "gh"                       # GitHub CLI for managing PRs/issues
brew "git-delta"                # Better `git diff` and `grep` output
brew "pnpm"                     # Fast, efficient Node.js package manager
brew "prettyping"               # Prettified `ping` output
brew "python@3"                 # Required for `awscli`
brew "starship"                 # Prompt customization
brew "tlrc"                     # Community-driven command-line docs
brew "trash-cli"                # Record/remove/restore files (better `rm`)
brew "webp"                     # Image format optimization
brew "zsh-autosuggestions"      # Autosuggestions for Zsh
brew "zsh-syntax-highlighting"  # Syntax highlighting for Zsh
brew "eza"                      # modern ls

# Additional Tools
brew "git-friendly"             # Simplify Git commands
brew "lazydocker"               # Full Docker management CLI
brew "oven-sh/bun/bun"          # JavaScript runtime
brew "xcode-build-server"       # SourceKit LSP for iOS


# Apps
cask "cheatsheet"
cask "dropbox"
cask "eul"                  # System monitor
cask "flipper"              # App debugger
cask "hammerspoon"
cask "proxyman"
cask "iterm2"
cask "raycast"
cask "steam"
cask "trader-workstation"   
cask "transmission"
cask "cursor"               # Text editor
cask "iina"                 # Media player
cask "shottr"               # Screenshot App
cask "mate-translate"
cask "sf-symbols"
cask "android-studio"
cask "arc"                   # browser
cask "clop"                  # Image, Video & PDF optimizer
cask "monitorcontrol"        # When working with external monitors
cask "slack"
cask "nikitabobko/tap/aerospace"
cask "boop"                  # Developer helper tool
cask "popclip"               # Mouse click extra action
cask "obsidian"              # In future move to obsidian
cask "orbstack"              # docker containers
cask "syntax-highlight", args: { no_quarantine: true } # Preview many different source code files
cask "optimage"              # Image optimization
cask "jordanbaird-ice"       # Menu bar organiser
cask "dropzone"              # Temporary file container


# Apps which is not available via brew
