tap "d12frosted/emacs-plus"
tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "keith/formulae"
tap "mongodb/brew"
tap "spotify/sptaps", "git@ghe.spotify.net:shared/homebrew-spotify.git"


brew "apr-util"
brew "aspell"
brew "fzf"
brew "lf"
brew "automake"
brew "awscli"
brew "bash"
brew "bazel", link: false
brew "bazelisk", link: false
brew "boost"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "diff-so-fancy"
brew "direnv"
brew "guile"
brew "unbound"
brew "gnutls"
brew "fd"
brew "harfbuzz"
brew "libass"
brew "srt"
brew "ffmpeg"
brew "findutils"
brew "git"
brew "git-lfs"
brew "go"
brew "grep"
brew "grpc"
brew "htop"
brew "httpie"
brew "hub"
brew "jq"
brew "languagetool"
brew "lazygit"
brew "libvterm"
brew "luv"
brew "mackup"
brew "mas"
brew "maven"
brew "node@16"
brew "mongosh"
brew "neovim"
brew "nghttp2"
brew "node"
brew "nvm"
brew "poppler"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "subversion"
brew "swift-format"
brew "swiftlint"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "spotify/sptaps/hmtools"
brew "midnight-commander"
brew "inav"



# Apps 
cask "anki"
cask "arduino"
cask "cheatsheet"
cask "dozer"
cask "dropbox"
cask "eul"
cask "flipper"
cask "flycut"
cask "font-fira-code"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "franz"
cask "hammerspoon"
cask "iterm2"
cask "kap"
cask "keyboardcleantool"
cask "raycast"
cask "razorsql"
cask "rectangle"
cask "skitch"
cask "steam"
cask "trader-workstation"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "shottr"
cask "mate-translate"
cask "browserosaurus"
cask "fig"
